package com.ohgiraffers.section02.variable;

public class Application3 {

    public static void main(String[] args){

        /* 수업목표 : 변수의 명명 규칙에 대해 이해할 수 있다. */
        /* 변수의 명명규칙
        * 변수의 이름을 지을 때는 정해진 규칙이 있다.
        * 실무적으로 굉장히 중요하기 때문에 반드시 숙지해야 하고
        * 규칙에 맞는 올바른 변수명을 짓는 것이 좋은 프로그래밍의 첫 단추다. */

        /*
        * 변수의 명명 규칙
        * 1. 컴파일 에러를 발생시키는 규칙
        *   1-1. 동일한 범위 내에서 동일한 변수명을 가질 수 없다.
        *   1-2. 예약어는 사용이 불가능하다.(예약어 : 자바에서 미리 사용하겠다고 컴파일러와 약속한 키워드)
        *   1-3. 변수명은 대/소문자를 구분한다(자바는 대/소문자를 구분하는 언어)
        *   1-4. 변수명은 숫자로 시작할 수 없다(중간에 섞는 것은 가능)
        *   1-5. 특수기호는 '_'와 '$'만 사용가능(공백도 불가능)
        *
        * 2. 컴파일 에러를 발생시키지는 않지만 개발자끼리의 암묵적인 규칙
        *   2-1. 변수명의 길이 제한은 없다.
        *   2-2. 변수명이 합성어로 이루어진 경우 첫단어는 소문자, 두번째 단어는 대문자로 한다.(camelCase)
        *   2-3. 단어와 단어 사이의 연결은 언더스코어로 하지 않는다(타 언어의 네이밍 규칙(snake_case))
        *   2-4. 한글로 변수명을 짓는 것은 가능하지만 권장하지 않는다(에러가능성)
        *   2-5. 변수 안의 저장된 값의 의미를 정확하게 표현하도록 한다
        *   2-6. 전형적인 변수 이름이 있으면 가급적 사용한다
        *   2-7. 명사형으로 작성하도록 한다.
        *   2-8. boolean형은 의문문으로 가급적 긍정적인 형태로 네이밍한다.
        * */

        /* 1. 컴파일 에러를 발생시키는 규칙 */
        /* 1-1. 동일한 범위 내에서 동일한 변수를 가질 수 없다. */
        int age = 20;
        //int age = 30;
        //String age = "";

        /* 1-2. 예약어는 사용 불가능 */
        //int true = 1;

        /* 1-3. 변수명은 대소문자를 구분한다. */
        int Age = 20;   //위에서 만든 int age와는 별개의 것으로 취급
        int True = 10;  //예약어 True와는 다른 것으로 취급

        /* 1-4. 변수명은 숫자로 시작할 수 없다. */
        //int 1age = 10;
        int age1 = 10;  //첫 시작만 아니면 숫자도 섞어서 명명 가능

        /* 1-5. 특수기호는 '_'와 '$'만 사용가능하다. */
        //int a@ge = 10;
        int _age = 20;  //언더스코어 사용가능
        int a$ge = 20;  //$ 사용가능

        /* 2. 컴파일 에러를 발생시키지는 않지만 개발자끼리의 암묵적인 규칙 */
        /* 2-1. 변수명의 길이제한은 없다. 하지만 적당히 하자. */
        int asdfasadfasdfasdfasdfasdf;

        /* 2-2. 변수명이 합성어로 이루어진 경우 첫단어는 소문자, 두번째 단어부터 대문자로 시작*/
        /*자바에서는 클래스명만 유일하게 대문자로 시작*/
        int maxAge = 100;

        /* 2-3. 단어와 단어 사이는 언더스코어(_)로 하지 않는다.*/
        String user_name;   //에러발생은 않지만 이렇게 하면 안된다.
        String userName;

        /* 2-4. 한글로 변수명을 짓는 것은 가능하지만 권장하지 않는다 */
        int 나이;

        /* 2-5. 변수 안에 저장된 값이 어떤 의미를 가지는지 정확하게 표현하도록 한다. */
        String s;
        String name;

        /* 2-6. 전형적인 변수명이 있다면 가급적 사용한다. */
        int sum = 0;
        int max = 100;
        int min = -100;
        int count = 1;

        /* 2-7. 명사형으로 작성한다. */
        String goHome;
        String home;

        /* 2-8. boolean형은 의문문으로 가급적 긍정상태로 네이밍한다. */
        boolean isAlive = true;
        boolean isDead = false;
    }
}
